[
  {
    "name": "Pastor C. Sibanda",
    "role": "Pastor",
    "bio": "Guides the church in spiritual growth, preaching, and community outreach with a heart for discipleship."
  },
  {
    "name": "Nkosana Mapuma",
    "role": "Elder",
    "position": "Head Elder",
    "bio": "Provides steady oversight across financial, administrative, and civic ministries. Through Treasury, Clerical, and Religious Liberty, he ensures that the church operates with integrity, transparency, and spiritual conviction — safeguarding both our resources and our right to worship freely."
  },
  {
    "name": "Nkululeko Mnkandla",
    "role": "Elder",
    "position": "Assistant Head Elder",
    "bio": "Nurtures both prophetic insight and lifelong learning. Through Education, Voice of Prophecy, and the Spirit of Prophecy ministries, he guides the church in truth, teaching, and spiritual depth — ensuring that biblical understanding is preserved, proclaimed, and lived."
  },
  {
    "name": "Nqobile Zikhali",
    "role": "Elder",
    "position": "Elder",
    "bio": "Uplifts and mobilizes women and families through service and spiritual growth. Her leadership in Women’s Ministries, Dorcus, and AMO reflects a nurturing strength that empowers others to serve with grace, dignity, and conviction."
  },
  {
    "name": "Thulani Ngwenya",
    "role": "Elder",
    "position": "Elder",
    "bio": "Strengthens the church’s voice and spiritual education. Through Sabbath School and Communication, he fosters learning, dialogue, and digital outreach that connects hearts, deepens understanding, and builds community."
  },
  {
    "name": "Roy Sikhosana",
    "role": "Elder",
    "position": "Elder",
    "bio": "Fosters harmony in both home and worship. Through Family Life and Music, he cultivates environments where relationships deepen and praise rises — guiding the church in both intimacy and reverence."
  },
  {
    "name": "Richard Maplanka",
    "role": "Elder",
    "position": "Elder",
    "bio": "Leads with vision and stewardship, guiding Church Development and resource management. His leadership in Stewardship reflects a commitment to building spaces — both physical and spiritual — where faith can flourish and ministry can thrive."
  },
  {
    "name": "Simba Machoko",
    "role": "Elder",
    "position": "Elder",
    "bio": "Serves with quiet strength, supporting both the physical and spiritual needs of the church. Through Deacons and Prison Ministries, he extends care to the congregation and brings hope to those behind bars — embodying Christ’s compassion in action."
  },
  {
    "name": "Doubt  Makunike",
    "role": "Elder",
    "position": "Elder",
    "bio": "Champions outreach and truth-sharing. Through Personal Ministries and Publishing, he equips members to share the gospel boldly and ensures that literature and learning remain central to our mission of reaching hearts and homes."
  },
  {
    "name": "Sibongumusa Dhlodhlo",
    "role": "Elder",
    "position": "Elder",
    "bio": "Nurtures the next generation and coordinates spiritual gatherings that renew the soul. His leadership in Children’s Ministries, Youth Ministries, and Camp Meeting ensures that every age group is embraced, empowered, and spiritually fed."
  },
  {
    "name": "Omega G. Ncube",
    "role": "Elder",
    "position": "Elder",
    "bio": "leads with compassion and inclusivity. Through Health Ministries, Possibilities Ministries, and PAKIA, he promotes holistic well-being and ensures that every member — regardless of ability or background — finds belonging, strength, and purpose."
  },
  {
    "name": "Sukoluhle Sibanda",
    "role": "Deacon",
    "bio": "Focuses on community outreach and member care, ensuring the church remains a beacon of hope."
  },
  {
    "name": "Tymate Ndlovu",
    "role": "Deacon",
    "bio": "Assists in church operations and supports members through practical service and care."
  },
  {
    "name": "Philani Sibanda",
    "role": "Deacon",
    "bio": "Plays a key role in church hospitality and member support, enhancing the fellowship experience."
  },
  {
    "name": "Ralph Makuyana",
    "role": "Deacon",
    "bio": "Dedicated to serving the church community with kindness, ensuring a welcoming environment for all."
  },
  {
    "name": "Dumisani Khanye",
    "role": "Deacon",
    "bio": "Committed to supporting church activities and assisting members in their spiritual journey."
  },
  {
    "name": "Ntando Moyo",
    "role": "Deacon",
    "bio": "Works diligently to uphold the values of the church, promoting spiritual growth and community service."
  },
  {
    "name": "Gareth Foya",
    "role": "Deacon",
    "bio": "Leads with integrity and a servant's heart, fostering a supportive and loving church environment."
  },
  {
    "name": "Wandile Khuphe",
    "role": "Deacon",
    "bio": "Committed to the spiritual well-being of the congregation, providing guidance and support."
  }
]